Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: དེ་ནི་ཉོན་མོངས་པའི་དཔུང་ཐམས་ཅད་རྣམ་པར་དཀྲུགས་པ་ལ་ཤིན་ཏུ་དཔའ་བ་ལགས།
en: They are heroes who alarm all the hosts of the kleśas.

source: དེ་ནི་འཁོར་བའི་འབྲོག་དགོན་པར་ལུས་པ་རྣམས་ཀྱི་ལམ་སྟོན་པ་ལགས།
en: They are the guides for those lost in the wilderness of saṃsāra.

source: དེ་ནི་ཉོན་མོངས་པའི་ནད་ཀྱིས་ཐེབས་པ་རྣམས་ཀྱི་སྨན་པར་གྱུར་པ་ལགས།
en: They are physicians for those afflicted by the illness of the kleśas.

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུལ་དུ་ཕྱིན་པ་ལགས།
en: They are supreme among all beings.

source: དེ་ནི་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་དབང་པོ་ལགས། དེ་ནི་འཕགས་པའི་གང་ཟག་ཐམས་ཅད་ཀྱི་ཐུ་བོ་ལགས།
en: They are lords of all lords of the world. They are the most senior among all ārya individuals.

source: དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ལགས།
en: They are the chief of all śrāvakas and pratyeka­buddhas.

source: དེ་ནི་འཁོར་བའི་རྒྱ་མཚོ་ལ་རྒྱུ་བ་རྣམས་ཀྱི་སྐྱབས་འཛིན་པ་ལགས།
en: They are the sea captains for those who are in the ocean of saṃsāra.

source: དེས་ནི་སེམས་ཅན་གདུལ་བའི་ཐབས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་བཤལ་བ་ལགས། དེས་ནི་འགྲོ་བ་ཡོངས་སུ་སྨིན་པ་རྣམས་ཀྱི་དབང་པོ་རྣམ་པར་གཟིགས་པ་ལགས།
en: They wash others with the great ocean of methods of guiding beings. They see the faculties of ripened beings.

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་པ་ལགས།
en: They are dedicated to gathering all beings.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ་ལགས།
en: They are dedicated to protecting all bodhisattvas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ཐམས་ཅད་ལ་ཡང་དག་པར་འགྲོ་བར་བརྩོན་པ་ལགས།
en: They are dedicated to remaining within the activities of bodhisattvas.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་གནས་པ་ལགས།
en: They are present at the feet of all the tathāgatas.

source: དེ་ནི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་མངོན་པར་འཕགས་པ་ལགས།
en: They are superior among all the assemblies of followers.

source: དེ་ནི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་སུ་གཟུགས་བརྙན་སྣང་བ་ལགས།
en: Their image appears within the abodes of all beings.

source: དེ་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ་ལགས།
en: They are unstained by any worldly quality.

source: དེ་ནི་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ལགས།
en: They have transcended the scope of all māras.

source: དེ་ནི་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་བཞུད་པ་ལགས།
en: They follow the scope of all the buddhas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པ་བརྙེས་པ་ལགས།
en: They attain without obscuration the scope of all bodhisattvas.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པར་བརྩོན་པ་ལགས།
en: They are dedicated to making offerings to all the tathāgatas.

source: དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་རྒྱུད་ཀྱི་ཚུལ་གཅིག་ཏུ་གྱུར་བ་ལགས།
en: They unite into one way all the Dharmas of the buddhas.

source: དེ་ནི་དབང་བསྐུར་བའི་ཐབས་ཐོབ་པ་ལགས།
en: They have attained the method of consecration.

source: དེ་ནི་ཆོས་ཀྱི་རྒྱལ་སྲིད་ཆེན་པོ་ལ་གནས་པར་འགྱུར་བ་ལགས།
en: They dwell in the great kingdom of the Dharma.

source: དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་དབང་བསྐུར་བ་ལགས།
en: They are consecrated for the scope of the wisdom of omniscience.

source: དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་འབྱུང་བ་ལགས།
en: They are from all the Dharmas of the buddhas.

source: དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དབང་བསྒྱུར་བའི་མཐར་ཕྱིན་པ་ལགས་ན།
en: They have fully accomplished power over omniscient wisdom.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ནན་ཏན་དུ་བགྱིས་ན།
en: “Ārya, I pray that you teach me how bodhisattvas should train in bodhisattva conduct, how they should practice it, how practicing bodhisattvas should attain all the Dharmas of the buddhas; serve the realms of beings by taking care of them; correctly reach the conclusion of the commitments that have been made; accomplish the great bodhisattva conduct that has been undertaken;

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་འགྱུར་བ་དང་། སེམས་ཅན་གྱི་ཁམས་ཇི་ལྟར་གཉེར་བའི་ཚུལ་བཞིན་དུ་རིམ་གྲོར་བགྱིད་པར་འགྱུར་བ་དང་། ཡི་དམ་ཇི་ལྟར་བཅས་པའི་ཚུལ་བཞིན་དུ་མཐར་ཕྱིན་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཆེན་པོ་བརྩམས་པ་གྲུབ་པར་འགྱུར་བ་དང་། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དབུགས་འབྱིན་པར་འགྱུར་བ་དང་། བདག་དང་སེམས་ཅན་དང་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་བསླུ་བར་མི་འགྱུར་བ་དང་སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་གཅོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རིགས་སྟོང་བར་མི་འབྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: bring relief to worlds and their devas; not deceive themselves, beings, the Buddha, the Dharma, and the Saṅgha; not be separated from the family lineage of the buddhas; not make empty the family of the bodhisattvas; and become holders of all the ways of the tathāgatas.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་ཐམས་ཅད་ལ་བལྟས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཉེ་བར་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དག་ཚོང་དཔོན་གྱི་བུ་འདི་འདི་ལྟར་ང་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་ཡོན་ཏན་ཡོངས་སུ་བསྒྲུབ་པ་འདྲི་བ་ལ་ལྟོས།
en: The bodhisattva mahāsattva Maitreya looked at all his assembly of followers and, indicating Sudhana, the head merchant’s son, said, “Noble ones, regard how this head merchant’s son has asked me about the accomplishment of bodhisattva conduct and qualities.

source: བཟོད་པ་ཅན་དག་ཚོང་དཔོན་གྱི་བུ་འདི་ནི་བརྩོན་འགྲུས་བརྩམས་པ་འདི་ལྟ་བུ་དང་དོན་དུ་གཉེར་བ་འདི་ལྟ་བུ་དང་མོས་པའི་ཡི་དམ་འདི་ལྟ་བུ་དང་ལྷག་པའི་བསམ་པ་བརྟན་པ་འདི་ལྟ་བུ་དང་བརྩོན་འགྲུས་མི་ཟློག་པ་འདི་ལྟ་བུ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་མི་ངོམས་པར་འདི་ལྟ་བུ་དང་། ཁྱད་པར་ཡོངས་སུ་བཙལ་བ་འདི་ལྟ་བུ་དང་མགོའི་ཐོད་ལ་མེ་འབར་བ་ལྟ་བུར་སྤྱོད་པ་འདི་ལྟ་བུ་དང་དགེ་བའི་བཤེས་གཉེན་མཐོང་བར་འདོད་པ་འདི་ལྟ་བུ་དང་། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བས་སྐྱོ་བ་མེད་པ་འདི་ལྟ་བུས་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་ཞིང་ཡོངས་སུ་དྲི་བ་དང་། བསྙེན་བཀུར་བ་བྱེད་ཅིང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཏང་ནས་གྲོང་ཁྱེར་དཔལ་གྱི་འབྱུང་གནས་ཉེ་བར་བཟུང་བ་ནས་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་ཐམས་ཅད་དུ་རྒྱུས་ཏེ།
en: Patient ones, this head merchant’s son, with this kind of diligent undertaking, with this kind of dedication to a goal, with this kind of aspiring commitment, with this kind of firm motivation, with this kind of unflagging diligence, with this kind of unceasing appetite for the Buddha’s Dharma, with this kind of quest for what is superior, with this kind of conduct as if his hair were on fire, with this kind of longing to see kalyāṇamitras, with this kind of unwearying service to the kalyāṇamitras, has sought out all kalyāṇamitras, questioned them, and honored them.

source: དགེ་བའི་བཤེས་གཉེན་བརྒྱ་རྩ་བཅུ་ལ་ཡོངས་སུ་དྲི་བ་བྱེད་ཅིང་། ཐ་མ་ངའི་དྲུང་འདིའི་བར་དུ་སྐྱོ་བ་ཐམས་ཅད་དང་བྲལ་བའི་ལྷག་པའི་བསམ་པས་ཕྱིན་ཏེ།
en: Sent by Mañjuśrī Kumāra­bhūta, starting from the city of Dhanyākara, he has roamed throughout the southern region, asked questions of a hundred and ten kalyāṇamitras, and finally come before me, throughout that time proceeding with a superior motivation free of any kind of weariness.

source: རིགས་ཀྱི་བུ་དག་རྣམ་པ་འདི་ལྟ་བུར་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡི་དམ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པ་དང་། བསམ་པ་ཆེན་པོ་ལ་རབ་ཏུ་རྟུལ་བའི་ཡིད་དང་ལྡན་པ། སྙིང་རྗེ་ཆེན་པོའི་གོ་བགོས་པའི་ངད་དང་ལྡན་པ། བྱམས་པ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་བློ་གྲོས་ཅན་བརྩོན་འགྲུས་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་བརྩོན་པ། སེམས་ཅན་གྱི་ལམ་གྲོགས་མང་པོ་ཡོངས་སུ་བསྐྱང་བ་ལ་མངོན་པར་བརྩོན་པ། འཁོར་བའི་རྒྱ་མཚོ་ཆེན་པོ་ལས་སེམས་ཅན་བསྒྲལ་བ་ལ་ཞུགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ཆེན་པོ་ལ་ཞུགས་པ། ཆོས་ཀྱི་གྲུ་ཆེན་པོ་ཡང་དག་པར་བཤམ་པ་ལ་བརྩོན་པ། ཆོས་ཆེན་པོ་དང་བསོད་ནམས་རིན་པོ་ཆེ་ཡོངས་སུ་བསྡུ་བ་ལ་རབ་ཏུ་རྟུལ་བ། ཆོས་ཀྱི་མཆོད་སྦྱིན་ཆེན་པོའི་ཚོགས་བསྩགས་པ་ལ། བརྩོན་པ་རྣམས་ཀྱི་མིང་ཐོས་པའམ། གཟུགས་ཀྱི་ལུས་མཐོང་བའམ་སྤྱོད་ཡུལ་དུ་འགྲོགས་པའམ། སྤྱོད་པ་དང་སྐལ་བ་མཉམ་པ་ནི་ཤིན་ཏུ་དཀོན་ནོ།
en: “Noble ones, it is very rare to hear the name, see the body, accompany the field of activity, or have a conduct equal to that of someone who is, in this way, established in the Mahāyāna, who has maintained a great commitment, who has a mind that is disciplined by a great aspiration, who wears the armor of great compassion, who has the intention to protect all beings with great love, who is dedicated to the perfection of diligence, who is dedicated to protecting the multitude of fellow traveling beings, who is engaged in freeing beings from the great ocean of saṃsāra, who is a follower of the great path to omniscience, who is dedicated to making available the great ship of the Dharma, who is determined to accumulate great Dharma and precious merit, and who is dedicated to gathering the accumulation of a great gift of the Dharma.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: རིགས་ཀྱི་བུ་སྐྱེས་བུ་དམ་པ་འདི་ནི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་དོན་དུ་བྱུང་བ་སྟེ།
en: Noble ones, it is because this excellent individual has risen up in order to protect all beings.

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བ་དང་། ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་བསྩལ་པ་དང་། མི་ཁོམ་པའི་ལམ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། ལམ་ཉམ་ང་བ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བ་དང་། མི་ཤེས་པའི་མུན་པ་ནག་པོ་ཐམས་ཅད་རྣམ་པར་བསྩལ་བ་དང་། འཁོར་བའི་འབྲོག་དགོན་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་། འགྲོ་བའི་རྒྱུད་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་། གནས་ཀྱི་རྟེན་ཐམས་ཅད་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། རྟེན་གྱི་གཞི་ཐམས་ཅད་ལས་བསྐུལ་བ་དང་། འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་མི་གནས་པར་བྱ་བ་དང་། འདོད་པའི་འདམ་ནས་ཡང་དག་པར་འདོན་པ་དང་། དགའ་བའི་འདོད་ཆགས་སྤང་བ་དང་། ལྟ་བའི་བཅིངས་པ་གཏུབ་པ་དང་། འཇིག་ཚོགས་ལ་མངོན་པར་ཞེན་པ་རྣམ་པར་བཟློག་པ་དང་། འདུ་ཤེས་ཀྱི་ཞགས་པ་ཡང་དག་པར་གཅད་པ་དང་། ཕྱིན་ཅི་ལོག་གི་ལམ་ནས་རྣམ་པར་བཟློག་པ་དང་། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བསྙལ་བ་དང་། བག་ལ་ཉལ་བའི་ཟུག་རྔུ་ཡང་དག་པར་དབྱུང་བ་དང་། སྒྲིབ་པའི་སྒོ་གླེགས་གཞོམ་པ་དང་། སྒྲིབ་པའི་རི་རྣམ་པར་གཏོར་བ་དང་། སྲེད་པའི་དྲ་བ་ནས་གདོན་པ་དང་། མ་རིག་པའི་ཀུན་ཏུ་སྦྱོར་བ་ལས་དབྱེ་བ་དང་། སྲིད་པའི་ཆུ་བོ་ལས་བསྒྲལ་བ་དང་། གཡོ་དང་སྒྱུ་སྤང་བ་དང་སེམས་ཀྱི་རྙོག་པ་གདང་བ་དང་། ཐེ་ཚོམ་དང་ཡིད་གཉིས་དང་ནེམ་ནུར་བསྩལ་བ་དང་། མི་ཤེས་པའི་ཆུ་བོ་ཆེན་པོ་ལས་བསྒྲལ་བ་དང་། འཁོར་བའི་སྐྱོན་ཐམས་ཅད་རྣམ་པར་སྨད་པའི་ཕྱིར་རབ་ཏུ་ཞུགས་པའོ།
en: He has appeared in order to free all beings from suffering; in order to eliminate all lower existences; in order to dispel all inopportune paths; in order that all frightening paths be forsaken; in order to dispel all the darkness of ignorance; in order that all the wildernesses of saṃsāra be left behind; in order to repel all the cycles of the existences of beings; in order to transcend the scope of all māras; in order that all bases of dependency be risen above; in order that there will be no basis in any of the classes of existence; in order that beings will be extracted from the swamp of desire; in order that they forsake desire for pleasures; in order that they cut through the bondage of views; in order that they eliminate attachment to the false view of destructible aggregations; in order that they cut through the noose of conceptualization; in order that they turn away from incorrect paths; in order to bring down the banner of pride; in order to extract the splinters of habits; in order to destroy the door of obscurations; in order to disintegrate the mountain of obscurations; in order to extract beings from the net of craving; in order to separate beings from the conduct of ignorance; in order to bring beings across the great river of existences; in order for beings to forsake deception and deceit; in order to purify minds of pollution; in order to eliminate doubt, uncertainty, and hesitation;

source: །རིགས་ཀྱི་བུ་སྐྱེས་བུ་དམ་པ་འདི་ནི་སེམས་ཅན་རྣམས་ཆུ་བོ་བཞི་ལས་ཡོངས་སུ་བསྒྲལ་བའི་ཕྱིར་ཆོས་ཀྱི་གྲུ་ཆེན་པོ་ཡང་དག་པར་བཤམ་པར་འདོད་པའོ།
en: in order to bring beings across the great river of ignorance; and in order that beings be revolted by the faults of saṃsāra. “Noble ones, this excellent individual wishes to provide beings with the ship of the Dharma in order to take them across the four great rivers.

source: །ལྟ་བའི་འདམ་དུ་བྱིང་བ་རྣམས་ཆོས་ཀྱི་རྐང་སྟེགས་ཆེན་པོ་དགོད་པར་འདོད་པའོ།
en: He wishes to bring those who are sinking in the swamp of wrong views onto the raised ground of the Dharma.

source: །གཏི་མུག་གི་མུན་པར་འཐོམས་པ་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་དབྱུང་བར་འདོད་པའོ།
en: He wishes to bring the light of wisdom to those enveloped in the darkness of ignorance.

source: །འཁོར་བའི་མྱ་ངམ་དུ་འཁྱམས་པ་རྣམས་ལ་འཕགས་པའི་ལམ་བསྟན་པར་འདོད་པའོ།
en: He wishes to show the path of the āryas to those wandering in the wilderness of saṃsāra.

source: །ཉོན་མོངས་པའི་ནད་ཆེན་པོས་གཟིར་བ་རྣམས་ལ་ཆོས་ཀྱི་སྨན་སྦྱིན་པར་འདོད་པའོ།
en: He wishes to give the medicine of the Dharma to those tormented by the great illness of the kleśas.

source: །སྐྱེ་བ་དང་རྒ་བ་དང་འཆི་བས་གཙེས་པ་རྣམས་ལ་འཆི་བ་མེད་པའི་དབྱིངས་སྦྱིན་པར་འདོད་པའོ།
en: He wishes to provide the realm of deathlessness to those oppressed by birth, aging, and death.

source: །མེ་གསུམ་རབ་ཏུ་འབར་བ་རྣམས་ལ་ཞི་གནས་ཀྱི་ཆུས་རབ་ཏུ་ཞི་བར་བྱ་བར་འདོད་པའོ།
en: He wishes to extinguish the three blazing fires with the water of śamatha.

source: །མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་ཡིད་མི་བདེ་བ་དང་འཁྲུག་པས་གདུངས་པ་རྣམས་ལ་དབུགས་ཕྱིན་པ་ཆེན་པོ་སྦྱིན་པར་འདོད་པའོ།
en: He wishes to bring great relief to those who are distressed by misery, wailing, unhappiness, and tribulation.

source: །སྲིད་པའི་བཙོན་རས་འཁོར་བ་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་མཚོན་ཆ་སྦྱིན་པར་འདོད་པའོ། །ལྟ་བའི་བཅིངས་པས་གླགས་པ་རྣམས་ལ་ཤེས་རབ་ཀྱི་མཚོན་ཆས་བསྡུད་པར་འདོད་པའོ།
en: He wishes to give the weapon of wisdom to those imprisoned in the wheel of existences. He wishes to give the weapon of wisdom to those beings in the bondage of wrong views.

source: །ཁམས་གསུམ་གྱི་གྲོང་ཁྱེར་གྱི་འཁོར་བ་རྣམས་ལ་ཐར་བའི་སྒོ་བསྟན་པར་འདོད་པའོ།
en: He wishes to show the gateway to liberation to those imprisoned in the city of the three realms.

source: །ཕྱོགས་མི་བདེ་བར་མངོན་པར་གཞོལ་བ་རྣམས་ལ་བདེ་བའི་ཕྱོགས་བསྟན་པར་འདོད་པའོ།
en: He wishes to reveal the safe direction to those who are going in the direction of danger.

source: །ཉོན་མོངས་པའི་ཆོམ་པོས་གཙེས་པ་རྣམས་ལ་དབུགས་ཕྱིན་པ་ཆེན་པོ་སྦྱིན་པར་འདོད་པའོ།
en: He wishes to bring great relief to those being attacked by the bandits of the kleśas.

source: །ངན་སོང་གི་གཡང་སས་འཇིགས་ཤིང་སྐྲག་པ་རྣམས་ལ་འཇུ་སའི་ལག་པ་བརྐྱང་བར་འདོད་པའོ།
en: He wishes to take by the hand those who are frightened and terrified by the abyss of the lower realms.

source: །ཕུང་པོའི་གཤེད་མས་གཙེས་པ་རྣམས་ལ་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་བསྟན་པར་འདོད་པའོ།
en: He wishes to show the city of nirvāṇa to those who have been seized by the murderers who are the skandhas

source: །ཁམས་ཀྱི་སྦྲུལ་གྱིས་ཀུན་ནས་འཁོར་བ་རྣམས་ལ་འཕགས་པའི་ལམ་གྱིས་འབྱུང་བ་བསྟན་པར་འདོད་པའོ།
en: He wishes to show escape through the path of the āryas to those encircled by the serpent of the dhātus

source: །སྐྱེ་མཆེད་ཀྱི་གྲོང་སྟོང་པ་ན་གནས་པ་རྣམས་ལ་ཤེས་རབ་ཀྱི་སྣང་བས་གདོན་པར་འདོད་པའོ།
en: He wishes to bring the illumination of the light of wisdom to those dwelling in deserted villages.

source: །མུ་སྟེགས་ངན་པ་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཡང་དག་པའི་མུ་སྟེགས་སུ་གཟུད་པར་འདོད་པའོ།
en: He wishes to bring those at bad fording places to the correct fording places.

source: །བཤེས་གཉེན་མ་ཡིན་པའི་ལག་ཏུ་ལྟུང་བ་རྣམས་ལ་ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་བསྟན་པར་འདོད་པའོ།
en: He wishes to show genuine kalyāṇamitras to those who have fallen into the hands of those who are not kalyāṇamitras.

source: །བྱིས་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་ལ་མངོན་པར་མོས་པ་རྣམས་འཕགས་པའི་ཆོས་ལ་རབ་ཏུ་དགོད་པར་འདོད་པའོ།
en: He wishes to bring to the Dharma of the āryas those who aspire to the field of conduct of foolish Dharma.

source: །འཁོར་བའི་ཁྱིམ་ལ་མངོན་པར་དགའ་བ་རྣམས་གྱེན་དུ་བསྐྱོད་དེ་ཐམས་ཅད་མཁྱེན་པའི་ཕོ་བྲང་དུ་གཟུད་པར་འདོད་པའོ།
en: He wishes to raise upward those who delight in the house of saṃsāra and bring them into the palace of omniscience.

source: །རིགས་ཀྱི་བུ་དག་དེ་ལྟར་སྐྱེས་བུ་དམ་པ་འདི་ནི་སེམས་ཅན་ཡོངས་སུ་བསྐྱོབ་པའི་བློ་གྲོས་དེ་ལྟ་བུས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྣམ་པར་དག་པར་བྱ་བ་ཡོངས་སུ་བཙལ་བ་ལ་རྒྱུན་མི་འཆད་པའོ།
en: “Noble ones, in that way, this excellent individual, with that kind of intention to save beings, continuously seeks to purify the development of the aspiration for enlightenment.

source: །ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་ཡོངས་སུ་སྐྱོ་བ་མེད་པའོ།
en: He never wearies in accomplishing the Mahāyāna.

source: །ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ལས་འཐུང་བས་མི་ངོམས་པའོ།
en: He is never satisfied in drinking from all the clouds of the Dharma.

source: །ཚོགས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་བརྩོན་པའོ།
en: He is continuously dedicated to completing all accumulations.

source: །ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར་མི་གཏོང་བ་ལ་བརྩོན་པའོ།
en: He is dedicated to never abandoning purifying all the gateways of the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་སྤྱད་པའི་ཕྱིར་བརྩོན་འགྲུས་མི་གཏོང་བའོ།
en: He never abandons his dedication to performing bodhisattva conduct.

source: །སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་མི་ལྡོག་པའི་སྦྱོར་བ་དང་ལྡན་པའོ།
en: He has unswerving application to accomplishing all prayers.

source: །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་མཐོང་བར་བྱ་བས་མི་ངོམས་པའོ།
en: He never has enough of seeing all kalyāṇamitras.

source: །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་བསྙེན་བཀུར་བས་ལུས་ལ་དུབ་པར་འགྱུར་བ་མེད་པའོ།
en: He is never fatigued in serving all kalyāṇamitras.

source: །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ལ་མཐུན་པར་འཛིན་པ་སྟེ།
en: He correctly holds the teaching of the instructions of all the kalyāṇamitras.

source: རིགས་ཀྱི་བུ་དག་སེམས་ཅན་གྱི་འཇིག་རྟེན་ན་སེམས་ཅན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པ་དེ་ལྟ་བུའི་སེམས་ཅན་དཀོན་ནོ།
en: “Noble ones, a being in the world of beings who has that kind of prayer for the highest, complete enlightenment is a rare being.

source: །དེ་བས་ཀྱང་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ཏེ།
en: Therefore, someone who, in setting out for the highest, complete enlightenment, accumulates the Dharma of the buddhas with this kind of diligent undertaking; who seeks the path of the bodhisattvas with this kind of intense aspiration; who purifies bodhisattva conduct with this kind of dedication; who serves the kalyāṇamitras through this kind of hardship; who with this kind of conduct, which is undertaken as if his hair were on fire, never disobeys the kalyāṇamitras;

source: བརྩོན་འགྲུས་བརྩམ་པའི་ཚུལ་འདི་ལྟ་བུས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྡུད་པ་དང་། མོས་པ་དྲག་པོ་འདི་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་ཚོལ་བ་དང་། དོན་དུ་གཉེར་བ་འདི་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ཉོན་མོངས་པ་འདི་ལྟ་བུས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བྱེད་པ་དང་། མགོའི་ཐོད་ལ་མེ་འབར་བ་ལྟར་སྤྱོད་པ་འདི་ལྟ་བུས་དགེ་བའི་བཤེས་གཉེན་གྱི་ངག་དང་འགལ་བར་མི་བྱེད་པ་དང་། ལྷག་པའི་བསམ་པ་བརྟན་པས་ནན་ཏན་ཏུ་བྱེད་པ་འདི་ལྟ་བུས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནན་ཏན་དུ་བྱེད་པ་དང་མཐུན་པར་ལེན་པ་འདི་ལྟ་བུས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་སྒྲུབ་པ་དང་། ཁེ་དང་བཀུར་སྟི་དང་སྙན་པ་དོན་དུ་མི་གཉེར་བ་འདི་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་ཁམས་དང་འགལ་བར་མི་བྱེད་པ་དང་། ཁྱིམ་དང་ལོངས་སྤྱོད་དང་འདོད་པའི་དགའ་བ་དང་བདེ་བ་དང་། ཕ་མ་དང་གཉེན་གཤེས་དང་། དངོས་པོ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པར་ཡོངས་སུ་བཏང་བ་འདི་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའི་གྲོགས་ཡོངས་སུ་ཚོལ་བ་དང་། ལུས་དང་སྲོག་ལ་འཕངས་པར་མི་རྩི་བ་འདི་ལྟ་བུས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་མོས་པར་བྱེད་པ་དེ་ལྟ་བུའི་སེམས་ཅན་ནི་ཆེས་དཀོན་ནོ།
en: who practices the instructions of the kalyāṇamitras by practicing with this kind of firm, superior motivation; who accomplishes the aspects of enlightenment with this kind of successful acquisition; who with this kind of disinterest in gain, honor, and fame never contradicts the nature of bodhisattva aspiration; who with this kind of renunciation, without attachment to home, possessions, desired delights, happiness, parents, friends, or anything, seeks the company of bodhisattvas; and who with this kind of lack of concern for his own body and life aspires to omniscience—such a being is extremely rare.

source: །རིགས་ཀྱི་བུ་དག་འདིས་ཇི་ལྟར་ཚེར་སྐྱེས་པ་འདི་གཅིག་ལ་ཇི་སྙེད་ཅིག་ཐོབ་པ་དང་། ཁོང་དུ་ཆུད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་མ་ཡིན་པ་གཞན་གྱིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ཐོབ་པ་དང་། ཁོང་དུ་ཆུད་པའམ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ཉེ་བར་འགྱུར་བའམ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའམ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའམ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པའམ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བསྒྲུབ་པའམ། སྤྱོད་པའི་དྲ་བ་རྒྱ་ཆེར་བྱ་བའམ་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའམ། བདུད་ཀྱི་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའམ། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའམ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་ཡོངས་སུ་དག་པར་བྱ་བའམ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་ཡང་དག་པར་འབྱུང་བ་མེད་དོ།
en: “Noble ones, no other bodhisattva has appeared in a hundred thousand quintillion kalpas who has attained and realized the perfection of bodhisattva conduct and prayer, or has come close to the enlightenment of buddhahood, or has purified a buddha realm, or has ripened and guided beings, or has entered the knowledge of the realm of phenomena, or has accomplished the perfections, or has spread the net of conduct, or has perfectly accomplished prayers, or has transcended the activities of the māras, or has served the kalyāṇamitras, or has accomplished and purified all bodhisattva conduct, or has perfected the strength of accomplishing completely good bodhisattva conduct in the way that he has attained and realized them in this one lifetime.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བ་ཟངས་ཀྱི་ཡོན་ཏན་དང་ལེགས་པ་ཡང་དག་པར་ཡོངས་སུ་བརྗོད་པ་བྱས་ནས། དེ་ལས་བརྟེན་ཏེ་སྲོག་ཆགས་བརྒྱ་ཕྲག་སྟོང་གིས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་བསམ་པ་བརྟན་པར་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་དོན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: Then, because of the bodhisattva mahāsattva Maitreya having described the qualities and excellences of Sudhana, the head merchant’s son, a hundred thousand beings, having strengthened their aspiration to the aspects of enlightenment, said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment in order to bring benefit and happiness to all worlds, in order to save all the realms of beings, and in order to attain all the Dharma of the buddhas.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དེ་ལྟར་སེམས་བསྐྱེད་པ་ནི་ཁྱོད་ཀྱིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་བོ། །ཁྱོད་ཀྱིས་མིའི་ལུས་ལེགས་པར་ཐོབ་བོ། །འཚོ་བའི་འཇིག་རྟེན་དུ་ཁྱོད་ལེགས་པར་འཚོས་སོ། །ཁྱོད་ཀྱིས་སངས་རྒྱས་འབྱུང་བ་དགྱེས་པར་བྱས་སོ། །ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་འཇམ་དཔལ་ལེགས་པར་མཐོང་ངོ་། །ཁྱོད་ཀྱི་བསམ་པའི་རྒྱུད་སྣོད་བཟང་པོར་གྱུར་ཏོ། །ཁྱོད་ནི་དགེ་བའི་རྩ་བས་མངོན་པར་བརླན་ཏོ། །ཁྱོད་ནི་དཀར་པོའི་ཆོས་ཀྱིས་ལེགས་པར་བརྟེན་ཏོ། །ཁྱོད་ཀྱིས་མོས་པ་རླབས་ཆེན་པོ་དང་དགེ་བའི་བསམ་པ་ལེགས་པར་ཤིན་ཏུ་སྦྱངས་སོ། །ཁྱོད་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལེགས་པར་དགོངས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ལེགས་པར་བཟུང་ངོ་།
en: “Noble one, it is because you have developed the aspiration for the highest, complete enlightenment that you have perfectly attained what is to be attained, you have the perfect attainment of a human life, you live perfectly in the world of the living, you have pleased the appearance of a buddha, you have perfectly seen the kalyāṇamitra Mañjuśrī, the continuum of your mind is an excellent vessel, you are saturated with roots of merit, you rely perfectly upon good qualities, you have perfectly purified your vast aspiration and your virtuous motivation, you are perfectly regarded by all the buddhas, and, noble one, you have been perfectly accepted by the kalyāṇamitras.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཀྱི་སེམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ས་བོན་ལྟ་བུའོ།
en: Noble one, the aspiration to enlightenment is like the seed of all the Dharma of the buddhas.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཆོས་དཀར་པོ་རྣམ་པར་འཕེལ་བར་བྱེད་པས་ཞིང་ལྟ་བུའོ། །འཇིག་རྟེན་ཐམས་ཅད་རབ་ཏུ་རྟེན་པས་ས་ལྟ་བུའོ།
en: It is like a field because it increases the good qualities of all beings.

source: །ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་དག་པར་བྱེད་པས་ཆུ་ལྟ་བུའོ།
en: It is like water because it cleans away the stains of the kleśas.
